# Easy

## Revising the Select Query I
Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

In [ ]:
SELECT * FROM CITY
WHERE Population  > 100000
AND CountryCode = 'USA';

## Revising the Select Query II
Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.

In [ ]:
SELECT Name FROM City           
WHERE Population > 120000
AND CountryCode = 'USA';

## Select All
Query all columns (attributes) for every row in the CITY table.

In [ ]:
SELECT * FROM CITY;

## Select By ID
Query all columns for a city in CITY with the ID 1661.

In [ ]:
SELECT * FROM City
WHERE ID = 1661;

## Japanese Cities' Attributes
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT * FROM City
WHERE CountryCode = 'JPN';

## Japanese Cities' Names
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT Name FROM City
WHERE CountryCode = 'JPN';

## Weather Observation Station 1
Query a list of CITY and STATE from the STATION table.

In [ ]:
SELECT City, State FROM Station;

## Weather Observation Station 3
Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.

In [ ]:
SELECT DISTINCT City
FROM Station
WHERE ID % 2 = 0;

## Weather Observation Station 4
Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

In [ ]:
SELECT (COUNT(City) - COUNT(DISTINCT City)) AS Difference
FROM Station;

## Weather Observation Station 5
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

In [ ]:
SELECT City, LENGTH(City) AS lengths 
FROM Station 
ORDER BY 2, 1 
LIMIT 1;

SELECT City, LENGTH(City) AS lengths 
FROM Station 
ORDER BY 2 DESC, 1 
LIMIT 1;

## Weather Observation Station 6
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City LIKE 'a%'
OR City LIKE 'e%'
OR City LIKE 'i%'
OR City LIKE 'o%'
OR City LIKE 'u%'
ORDER BY 1;

# OR (MySQL)
SELECT DISTINCT City FROM Station
WHERE City REGEXP '^[aeiou]'
ORDER BY 1;

## Weather Observation Station 7
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City LIKE '%a'
OR City LIKE '%e'
OR City LIKE '%i'
OR City LIKE '%o'
OR City LIKE '%u'
ORDER BY 1;

# OR (MySQL)
SELECT DISTINCT City FROM Station
WHERE City REGEXP '[aeiou]$'
ORDER BY 1;

## Weather Observation Station 8
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City REGEXP '^[aeiou].*[aeiou]$'
ORDER BY 1;

## Weather Observation Station 9
Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City REGEXP '^[^aeiou]'
ORDER BY 1;

SELECT DISTINCT City FROM Station
WHERE City RLIKE '^[^aeiou]'
ORDER BY 1;

## Weather Observation Station 10
Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City RLIKE '[^aeiou]$'
ORDER BY 1;

## Weather Observation Station 11
Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City RLIKE '^[^aeiou].*' 
OR City RLIKE'.*[^aeiou]$'
ORDER BY 1;

## Weather Observation Station 12
Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City RLIKE '^[^aeiou].*[^aeiou]$'
ORDER BY 1;

## Higher Than 75 Marks
Query the Name of any student in STUDENTS who scored higher than 75 Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

In [ ]:
SELECT Name FROM STUDENTS
WHERE Marks > 75
ORDER BY RIGHT(Name, 3), ID;

## Employee Names
Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

In [ ]:
SELECT name FROM Employee
ORDER BY 1;

## Employee Salaries
Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than $2000 per month who have been employees for less than 10 months. Sort your result by ascending employee_id.

In [ ]:
SELECT name FROM Employee
WHERE salary > 2000
AND months < 10 
ORDER BY employee_id;

## Type of Triangle
Write a query identifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:

Equilateral: It's a triangle with 3 sides of equal length.

Isosceles: It's a triangle with 2 sides of equal length.

Scalene: It's a triangle with 3 sides of differing lengths.

Not A Triangle: The given values of A, B, and C don't form a triangle.

In [ ]:
SELECT 
CASE WHEN A+B<=C OR A+C<=B OR B+C<=A THEN 'Not A Triangle'
     WHEN A=B AND B=C THEN 'Equilateral'
     WHEN A=B OR A=C OR B=C THEN 'Isosceles'
     WHEN A!=B AND B!=C AND A!=C THEN 'Scalene'       
END AS type_triangle
FROM TRIANGLES;

## Revising Aggregations - The Count Function
Query a count of the number of cities in CITY having a Population larger than 100,000.

In [ ]:
SELECT COUNT(DISTINCT ID) 
FROM CITY
WHERE POPULATION > 100000;

## Revising Aggregations - The Sum Function
Query the total population of all cities in CITY where District is California.

In [ ]:
SELECT SUM(POPULATION)
FROM CITY
WHERE DISTRICT = 'California';

## Revising Aggregations - Averages
Query the average population of all cities in CITY where District is California.

In [ ]:
SELECT AVG(POPULATION)
FROM CITY
WHERE DISTRICT = 'California';

## Average Population
Query the average population for all cities in CITY, rounded down to the nearest integer.

In [ ]:
SELECT ROUND(AVG(POPULATION))
FROM CITY;

## Japan Population
Query the sum of the populations for all Japanese cities in CITY. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT SUM(POPULATION) FROM CITY
WHERE COUNTRYCODE = 'JPN';

## Population Density Difference
Query the difference between the maximum and minimum populations in CITY.

In [ ]:
SELECT MAX(POPULATION) - MIN(POPULATION)
FROM CITY;

## The Blunder
Samantha was tasked with calculating the average monthly salaries for all employees in the EMPLOYEES table, but did not realize her keyboard's 0 key was broken until after completing the calculation. She wants your help finding the difference between her miscalculation (using salaries with any zeroes removed), and the actual average salary.

Write a query calculating the amount of error (i.e.: actual - miscalculated average monthly salaries), and round it up to the next integer.

In [ ]:
SELECT CEIL(AVG(Salary) - AVG(REPLACE(Salary,'0',''))) 
FROM EMPLOYEES;

## Top Earners
We define an employee's total earnings to be their monthly salary x months worked, and the maximum total earnings to be the maximum total earnings for any employee in the Employee table. Write a query to find the maximum total earnings for all employees as well as the total number of employees who have maximum total earnings. Then print these values as space-separated integers.

In [ ]:
SELECT (salary * months) AS earnings, COUNT(*)
FROM Employee
GROUP BY 1 
ORDER BY 1 DESC
LIMIT 1;

## Weather Observation Station 2
Query the following two values from the STATION table:

The sum of all values in LAT_N rounded to a scale of decimal places. 

The sum of all values in LONG_W rounded to a scale of decimal places.

In [ ]:
SELECT CAST(SUM(LAT_N) AS DECIMAL(10,2)) AS lat, 
       CAST(SUM(LONG_W) AS DECIMAL(10,2)) AS lon 
FROM Station;

# CAST: Converts a value (of any type) into a specified datatype
# Ex: DECIMAL(19,9) has 9 digits for the fractional part and 19-9 = 10 digits for integer part.

## Weather Observation Station 13
Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7880 and less than 137.2345. Truncate your answer to 4 decimal places.

In [ ]:
SELECT TRUNCATE(SUM(LAT_N), 4) AS lat
FROM Station
WHERE LAT_N BETWEEN 38.7880 AND 137.2345;

# TRUNCATE just drops digits after the specified digit, whereas ROUND might change the last digit by rounding

## Weather Observation Station 14
Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than 137.2345. Truncate your answer to 4 decimal places.

In [ ]:
SELECT TRUNCATE(MAX(LAT_N), 4)
FROM STATION
WHERE LAT_N < 137.2345;

## Weather Observation Station 15
Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than 137.2345. Round your answer to 4 decimal places.

In [ ]:
WITH temp AS (
    SELECT LAT_N, LONG_W
    FROM STATION
    WHERE LAT_N < 137.2345)

SELECT ROUND(LONG_W, 4)
FROM temp
ORDER BY LAT_N DESC
LIMIT 1;

# OR
SELECT ROUND(LONG_W, 4) 
FROM STATION 
WHERE LAT_N = (SELECT MAX(LAT_N) 
               FROM STATION 
               WHERE LAT_N < 137.2345);

## Weather Observation Station 16
Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7880. Round your answer to 4 decimal places.

In [ ]:
SELECT ROUND(MIN(LAT_N), 4)
FROM STATION
WHERE LAT_N > 38.7780;

## Weather Observation Station 17
Query the Western Longitude (LONG_W)where the smallest Northern Latitude (LAT_N) in STATION is greater than 38.7780. Round your answer to 4 decimal places.

In [ ]:
SELECT ROUND(MIN(LONG_W), 4)
FROM STATION
WHERE LAT_N = (SELECT MIN(LAT_N)
               FROM STATION
               WHERE LAT_N > 38.7780);

## Asian Population
Given the CITY and COUNTRY tables, query the sum of the populations of all cities where the CONTINENT is 'Asia'.

Note: CITY.CountryCode and COUNTRY.Code are matching key columns.

In [ ]:
SELECT SUM(CITY.POPULATION)
FROM CITY
JOIN COUNTRY
ON CITY.CountryCode = COUNTRY.Code
WHERE COUNTRY.CONTINENT = 'Asia';

## African Cities
Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.

Note: CITY.CountryCode and COUNTRY.Code are matching key columns.

In [ ]:
SELECT CITY.NAME
FROM CITY
JOIN COUNTRY
ON CITY.CountryCode = COUNTRY.Code
WHERE COUNTRY.CONTINENT = 'Africa';

## Average Population of Each Continent
Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer.

Note: CITY.CountryCode and COUNTRY.Code are matching key columns.

In [ ]:
SELECT COUNTRY.Continent, FLOOR(AVG(CITY.POPULATION))
FROM CITY
JOIN COUNTRY
ON CITY.CountryCode = COUNTRY.Code
GROUP BY COUNTRY.Continent;

## Draw The Triangle 1 
P(R) represents a pattern drawn by Julia in R rows. The following pattern represents P(5): 

Write a query to print the pattern P(20).

In [ ]:
SET @number = 21;
SELECT REPEAT('* ', @number := @number - 1) 
FROM INFORMATION_SCHEMA.TABLES;

## Draw The Triangle 2
P(R) represents a pattern drawn by Julia in R rows. The following pattern represents P(5):

Write a query to print the pattern P(20).

In [ ]:
SET @number = 0;
SELECT REPEAT('* ', @number := @number + 1) 
FROM INFORMATION_SCHEMA.TABLES
LIMIT 20;

# Medium

## The PADS
Generate the following two result sets:

Query an alphabetically ordered list of all names in OCCUPATIONS, immediately followed by the first letter of each profession as a parenthetical (i.e.: enclosed in parentheses). For example: AnActorName(A), ADoctorName(D), AProfessorName(P), and ASingerName(S).
Query the number of ocurrences of each occupation in OCCUPATIONS. Sort the occurrences in ascending order, and output them in the following format:

There are a total of [occupation_count] [occupation]s.
where [occupation_count] is the number of occurrences of an occupation in OCCUPATIONS and [occupation] is the lowercase occupation name. If more than one Occupation has the same [occupation_count], they should be ordered alphabetically.

Note: There will be at least two entries in the table for each type of occupation.

In [ ]:
SELECT CONCAT(Name, '(', LEFT(Occupation, 1), ')') 
FROM OCCUPATIONS
ORDER BY Name;

SELECT CONCAT('There are a total of ', 
              COUNT(Occupation), 
              ' ', 
              LOWER(Occupation), 
              's.') AS Occurences
FROM OCCUPATIONS
GROUP BY Occupation
ORDER BY Occurences;

# LEFT: Extracts a number of characters from a string (starting from left)

## Occupations
Pivot the Occupation column in OCCUPATIONS so that each Name is sorted alphabetically and displayed underneath its corresponding Occupation. The output column headers should be Doctor, Professor, Singer, and Actor, respectively.

Note: Print NULL when there are no more names corresponding to an occupation.

In [ ]:
SET @r1 = 0, @r2 = 0, @r3 = 0, @r4 = 0;
SELECT MIN(Doctor), MIN(Professor), MIN(Singer), MIN(Actor)
FROM (SELECT CASE WHEN Occupation = 'Doctor' THEN (@r1 := @r1 + 1)
                  WHEN Occupation = 'Professor' THEN (@r2:=@r2+1)
                  WHEN Occupation = 'Singer' THEN (@r3:=@r3+1)
                  WHEN Occupation = 'Actor' THEN (@r4:=@r4+1) END AS RowNumber,
             CASE WHEN Occupation = 'Doctor' THEN Name END AS Doctor,
             CASE WHEN Occupation = 'Professor' THEN Name END AS Professor,
             CASE WHEN Occupation = 'Singer' THEN Name END AS Singer,
             CASE WHEN Occupation = 'Actor' THEN Name END AS Actor
      FROM OCCUPATIONS
      ORDER BY Name
      ) Temp
GROUP BY RowNumber;

## Binary Tree Nodes
You are given a table, BST, containing two columns: N and P, where N represents the value of a node in Binary Tree, and P is the parent of N.

Write a query to find the node type of Binary Tree ordered by the value of the node. Output one of the following for each node:

Root: If node is root node.

Leaf: If node is leaf node.

Inner: If node is neither root nor leaf node.

In [ ]:
SELECT N, 
       CASE WHEN P IS NULL THEN 'Root'
            WHEN N IN (SELECT DISTINCT P FROM BST) THEN 'Inner'
            ELSE 'Leaf'
       END
FROM BST
ORDER BY N;

## New Companies

Amber's conglomerate corporation just acquired some new companies. Each of the companies follows this hierarchy: 

Founder => Lead Manager => Senior Manager => Manager => Employee

Given the table schemas below, write a query to print the company_code, founder name, total number of lead managers, total number of senior managers, total number of managers, and total number of employees. Order your output by ascending company_code.

Note:

The tables may contain duplicate records.
The company_code is string, so the sorting should not be numeric. For example, if the company_codes are C_1, C_2, and C_10, then the ascending company_codes will be C_1, C_10, and C_2.

In [ ]:
SELECT c.company_code, 
       c.founder, 
       COUNT(DISTINCT l.lead_manager_code), 
       COUNT(DISTINCT s.senior_manager_code), 
       COUNT(DISTINCT m.manager_code),
       COUNT(DISTINCT e.employee_code) 
FROM Company c, Lead_Manager l, Senior_Manager s, Manager m, Employee e 
WHERE c.company_code = l.company_code 
  AND l.lead_manager_code=s.lead_manager_code 
  AND s.senior_manager_code=m.senior_manager_code 
  AND m.manager_code=e.manager_code 
GROUP BY c.company_code, c.founder 
ORDER BY 1;

## Weather Observation Station 18
Consider P1(a, b) and P2(c, d) to be two points on a 2D plane.

a happens to equal the minimum value in Northern Latitude (LAT_N in STATION).

b happens to equal the minimum value in Western Longitude (LONG_W in STATION).

c happens to equal the maximum value in Northern Latitude (LAT_N in STATION).

d happens to equal the maximum value in Western Longitude (LONG_W in STATION).

Query the Manhattan Distance between points P1 and P2 and round it to a scale of  decimal places.

In [ ]:
SELECT ROUND((MAX(LAT_N) - MIN(LAT_N)) + (MAX(LONG_W) - MIN(LONG_W)), 4) 
FROM STATION;

## Weather Observation Station 19
Consider P1(a, c) and P2(b, d) to be two points on a 2D plane where (a, b) are the respective minimum and maximum values of Northern Latitude (LAT_N) and (c, d) are the respective minimum and maximum values of Western Longitude (LONG_W) in STATION.

Query the Euclidean Distance between points P1 and P2 and format your answer to display  decimal digits.

In [ ]:
SELECT ROUND(SQRT(POWER(MAX(LAT_N) - MIN(LAT_N), 2) + POWER(MAX(LONG_W) - MIN(LONG_W), 2)), 4)
FROM STATION;

## Weather Observation Station 20
A median is defined as a number separating the higher half of a data set from the lower half. Query the median of the Northern Latitudes (LAT_N) from STATION and round your answer to 4 decimal places.

In [ ]:
SET @N := 0;
SELECT COUNT(*) FROM STATION INTO @Total;  # SET @Total = (SELECT COUNT(*) FROM STATION);

SELECT ROUND(AVG(R.LAT_N), 4)
FROM (SELECT @N := @N +1 AS ROW_ID, 
             LAT_N 
      FROM STATION 
      ORDER BY LAT_N) R
WHERE CASE WHEN MOD(@Total, 2) = 0 THEN R.ROW_ID IN (@Total / 2, (@Total / 2 + 1))
           ELSE R.ROW_ID = (@Total + 1) / 2
      END
;

## The Report
You are given two tables: Students and Grades. Students contains three columns ID, Name and Marks.

Ketty gives Eve a task to generate a report containing three columns: Name, Grade and Mark. Ketty doesn't want the NAMES of those students who received a grade lower than 8. The report must be in descending order by grade -- i.e. higher grades are entered first. If there is more than one student with the same grade (8-10) assigned to them, order those particular students by their name alphabetically. Finally, if the grade is lower than 8, use "NULL" as their name and list them by their grades in descending order. If there is more than one student with the same grade (1-7) assigned to them, order those particular students by their marks in ascending order.

Write a query to help Eve.

In [ ]:
SELECT IF(g.Grade < 8, 'NULL', s.Name), 
       g.Grade, 
       s.Marks 
FROM Students s
JOIN Grades g 
ON s.Marks >= g.Min_Mark 
AND s.Marks <= g.Max_Mark 
ORDER BY g.Grade DESC, s.Name, s.Marks;

## Top Competitors
Julia just finished conducting a coding contest, and she needs your help assembling the leaderboard! Write a query to print the respective hacker_id and name of hackers who achieved full scores for more than one challenge. Order your output in descending order by the total number of challenges in which the hacker earned a full score. If more than one hacker received full scores in same number of challenges, then sort them by ascending hacker_id.

In [ ]:
SELECT h.hacker_id, h.name
FROM submissions s
JOIN challenges c
  ON s.challenge_id = c.challenge_id
JOIN difficulty d
  ON c.difficulty_level = d.difficulty_level 
JOIN hackers h
  ON s.hacker_id = h.hacker_id
WHERE s.score = d.score
GROUP BY h.hacker_id, h.name
HAVING COUNT(s.hacker_id) > 1
ORDER BY COUNT(s.hacker_id) DESC, s.hacker_id;

## Ollivander's Inventory
Harry Potter and his friends are at Ollivander's with Ron, finally replacing Charlie's old broken wand.

Hermione decides the best way to choose is by determining the minimum number of gold galleons needed to buy each non-evil wand of high power and age. Write a query to print the id, age, coins_needed, and power of the wands that Ron's interested in, sorted in order of descending power. If more than one wand has same power, sort the result in order of descending age.

In [ ]:
SELECT w.id, wp.age, w.coins_needed, w.power 
FROM Wands w 
JOIN Wands_Property wp 
  ON w.code = wp.code 
WHERE wp.is_evil = 0 
AND w.coins_needed = (SELECT MIN(coins_needed) 
                      FROM Wands w1 
                      JOIN Wands_Property wp1 
                        ON w1.code = wp1.code 
                      WHERE w1.power = w.power 
                        AND wp1.age = wp.age)
ORDER BY w.power DESC, wp.age DESC;

## Challenges
Julia asked her students to create some coding challenges. Write a query to print the hacker_id, name, and the total number of challenges created by each student. Sort your results by the total number of challenges in descending order. If more than one student created the same number of challenges, then sort the result by hacker_id. If more than one student created the same number of challenges and the count is less than the maximum number of challenges created, then exclude those students from the result.

In [ ]:
SELECT c.hacker_id, h.name, COUNT(c.challenge_id) AS created
FROM Hackers h
JOIN Challenges c
ON h.hacker_id = c.hacker_id
GROUP BY c.hacker_id, h.name
HAVING created = (SELECT COUNT(c1.challenge_id) AS created1
                  FROM Challenges c1
                  GROUP BY c1.hacker_id
                  ORDER BY created1 DESC
                  LIMIT 1)
OR created NOT IN (SELECT COUNT(c2.challenge_id)
                   FROM Challenges c2
                   GROUP BY c2.hacker_id
                   HAVING c.hacker_id != c2.hacker_id)
ORDER BY CREATED DESC, c.hacker_id;

## Contest Leaderboard
You did such a great job helping Julia with her last coding contest challenge that she wants you to work on this one, too!

The total score of a hacker is the sum of their maximum scores for all of the challenges. Write a query to print the hacker_id, name, and total score of the hackers ordered by the descending score. If more than one hacker achieved the same total score, then sort the result by ascending hacker_id. Exclude all hackers with a total score of 0 from your result.

In [ ]:
SELECT sm.hacker_id, h.name, SUM(sm.max_score) 
FROM (SELECT hacker_id, challenge_id, MAX(score) AS max_score 
      FROM Submissions
      GROUP BY hacker_id, challenge_id
      HAVING MAX(score) > 0) sm 
JOIN hackers h
  ON h.hacker_id = sm.hacker_id
GROUP BY hacker_id, name
ORDER BY 3 DESC, 1;

## SQL Project Planning
You are given a table, Projects, containing three columns: Task_ID, Start_Date and End_Date. It is guaranteed that the difference between the End_Date and the Start_Date is equal to 1 day for each row in the table.

If the End_Date of the tasks are consecutive, then they are part of the same project. Samantha is interested in finding the total number of different projects completed.

Write a query to output the start and end dates of projects listed by the number of days it took to complete the project in ascending order. If there is more than one project that have the same number of completion days, then order by the start date of the project.

In [ ]:
SELECT Start_Date, MIN(End_Date)
FROM (SELECT Start_Date 
      FROM Projects 
      WHERE Start_Date NOT IN (SELECT End_Date FROM Projects)) a,
     (SELECT End_date 
      FROM Projects 
      WHERE End_date NOT IN (SELECT Start_date FROM Projects)) b
WHERE Start_date < End_date
GROUP BY Start_date
ORDER BY DATEDIFF(Start_date, MIN(End_date)) DESC, Start_date;

## Placements
You are given three tables: Students, Friends and Packages. Students contains two columns: ID and Name. Friends contains two columns: ID and Friend_ID (ID of the ONLY best friend). Packages contains two columns: ID and Salary (offered salary in $ thousands per month).

In [ ]:
SELECT s.Name
FROM students s 
JOIN Friends f ON s.ID=f.ID
JOIN Packages p1 ON s.ID=p1.ID
JOIN Packages p2 ON f.Friend_ID=p2.ID
WHERE p2.Salary > p1.Salary
ORDER BY p2.Salary;

## Symmetric Pairs
You are given a table, Functions, containing two columns: X and Y.

Two pairs (X1, Y1) and (X2, Y2) are said to be symmetric pairs if X1 = Y2 and X2 = Y1.

Write a query to output all such symmetric pairs in ascending order by the value of X. List the rows such that X1 ≤ Y1.

In [ ]:
SELECT f1.X, f1.Y
FROM Functions f1 
JOIN Functions f2 
  ON f1.X = f2.Y AND f1.Y = f2.X
GROUP BY f1.X, f1.Y
HAVING COUNT(f1.X) > 1 OR f1.X < f1.Y
ORDER BY f1.X;

# The first condition in that line 
# makes sure pairs with the same X and Y values don't get to count themselves as their symmetric pair.

# The second condition ensures that only one of a pair is displayed.

## Print Prime Numbers
Write a query to print all prime numbers less than or equal to 1000. Print your result on a single line, and use the ampersand (&) character as your separator (instead of a space).

For example, the output for all prime numbers <=10 would be:

2&3&5&7

In [ ]:
SET @potential_prime = 1;
SET @divisor = 1;

SELECT GROUP_CONCAT(POTENTIAL_PRIME SEPARATOR '&') 
FROM (SELECT @potential_prime := @potential_prime + 1 AS POTENTIAL_PRIME 
      FROM information_schema.tables t1,
           information_schema.tables t2
      LIMIT 1000) list_of_potential_primes
WHERE NOT EXISTS (SELECT * 
                  FROM (SELECT @divisor := @divisor + 1 AS DIVISOR 
                        FROM information_schema.tables t3,
                             information_schema.tables t4
                        LIMIT 1000) list_of_divisors
                  WHERE MOD(POTENTIAL_PRIME, DIVISOR) = 0 
                    AND POTENTIAL_PRIME != DIVISOR);

# Hard

## Interviews (Hard)
Samantha interviews many candidates from different colleges using coding challenges and contests. Write a query to print the contest_id, hacker_id, name, and the sums of total_submissions, total_accepted_submissions, total_views, and total_unique_views for each contest sorted by contest_id. Exclude the contest from the result if all four sums are 0.

Note: A specific contest can be used to screen candidates at more than one college, but each college only holds 1 screening contest.

In [ ]:
SELECT con.contest_id,
       con.hacker_id, 
       con.name, 
       SUM(total_submissions), 
       SUM(total_accepted_submissions), 
       SUM(total_views), 
       SUM(total_unique_views)
FROM Contests con 
JOIN Colleges col 
  ON con.contest_id = col.contest_id 
JOIN challenges cha 
  ON col.college_id = cha.college_id 
LEFT JOIN (SELECT challenge_id, 
                  SUM(total_views) AS total_views, 
                  SUM(total_unique_views) AS total_unique_views
           FROM View_Stats 
           GROUP BY challenge_id) vs 
  ON cha.challenge_id = vs.challenge_id 
LEFT JOIN (SELECT challenge_id, 
                  SUM(total_submissions) AS total_submissions, 
                  SUM(total_accepted_submissions) AS total_accepted_submissions 
           FROM Submission_Stats 
           GROUP BY challenge_id) ss 
  ON cha.challenge_id = ss.challenge_id
GROUP BY con.contest_id, con.hacker_id, con.name
HAVING SUM(total_submissions) !=0
    OR SUM(total_accepted_submissions) != 0 
    OR SUM(total_views) !=0 
    OR SUM(total_unique_views) != 0
ORDER BY contest_id;

## 15 Days of Learning SQL
Julia conducted a 15 days of learning SQL contest. The start date of the contest was March 01, 2016 and the end date was March 15, 2016.

Write a query to print total number of unique hackers who made at least 1 submission each day (starting on the first day of the contest), and find the hacker_id and name of the hacker who made maximum number of submissions each day. If more than one such hacker has a maximum number of submissions, print the lowest hacker_id. The query should print this information for each day of the contest, sorted by the date.

In [ ]:
SELECT SUBMISSION_DATE,

       (SELECT COUNT(DISTINCT HACKER_ID)
        FROM SUBMISSIONS AS SUB2
        WHERE SUB2.SUBMISSION_DATE=SUB1.SUBMISSION_DATE
          AND (SELECT COUNT(DISTINCT SUBMISSION_DATE)
               FROM SUBMISSIONS AS SUB3
               WHERE SUB3.HACKER_ID = SUB2.HACKER_ID
                 AND SUB3.SUBMISSION_DATE < SUB1.SUBMISSION_DATE) 
               =DATEDIFF(SUB1.SUBMISSION_DATE,'2016-03-01')),
               
       (SELECT HACKER_ID
        FROM SUBMISSIONS AS SUB4
        WHERE SUB4.SUBMISSION_DATE=SUB1.SUBMISSION_DATE
        GROUP BY HACKER_ID
        ORDER BY COUNT(SUBMISSION_ID) DESC, HACKER_ID 
        LIMIT 1) AS HID,
        
       (SELECT NAME
        FROM HACKERS
        WHERE HACKER_ID=HID)
        
FROM (SELECT DISTINCT SUBMISSION_DATE 
      FROM SUBMISSIONS) AS SUB1;